Revit 2026 API

# ParameterDefinition Property

---

Returns the Definition object that describes the data type, name and other details of the parameter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Definition Definition { get; }
```
```vb
Public ReadOnly Property Definition As Definition
	Get
```
```cpp
public:
property Definition^ Definition {
	Definition^ get ();
}
```
```fsharp
member Definition : Definition with get
```

#### Property Value

Definition

This will always be an InternalDefinition object. If you want the Guid for a shared parameter, use GUID.

#### Reference

Parameter Class

Autodesk.Revit.DB Namespace